In [12]:
import pandas as pd

df = pd.read_csv("Titanic-Dataset.csv")

reportLines = []
for col in df.columns:
    dtype = df[col].dtype
    missingPart = df[col].isna().mean() * 100
    reportLines.append(f'{col}: {dtype}, missing: {missingPart}')

In [13]:
with open("reportFile.txt", "w") as file:
    for line in reportLines:
        file.write(line + '\n')

print("Reported saved to reportFile.txt.")

Reported saved to reportFile.txt.

In [14]:
df["Age"] = df.groupby(['Pclass', 'Sex'])["Age"].transform(lambda g: g.fillna(g.median()))
embarkedMode = df["Embarked"].mode()[0]
df["Embarked"] = df["Embarked"].fillna(embarkedMode)
if "Cabin" in df.columns:
    df = df.drop(columns=["Cabin"])

print("All Imputations done.")

All Imputations done.

In [15]:
df['FamilySize'] = df["SibSp"] + df["Parch"]
df["isAlone"] = (df["FamilySize"] == 0).astype(int)
df["Age"] = df["Age"].astype('int64')

In [ ]:
df.to_csv("Cleaned_Titanic_Dataset.csv", index=False)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,FamilySize,isAlone
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,S,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,S,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S,0,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21,1,2,W./C. 6607,23.4500,S,3,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C,0,1
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,Q,0,1